Repository: suraleb/10d
Catalog: html/languages/admin-update.tmx
Source language: en
Languages: ru

source: Update successfully downloaded and awaiting installation
ru: Обновление успешно загружено и ожидает установки

source: Allow to check if update packages exist
ru: Разрешить проверять наличие пакетов обновления

source: Allow to install packages
ru: Разрешить устанавливать пакеты

source: Allow to open the update module
ru: Разрешить открывать модуль обновлений

source: System update
ru: Обновление системы

source: Check for new updates
ru: Выполнить поиск обновлений

source: Update history
ru: История обновлений

source: Information
ru: Информация

source: Packages
ru: Пакеты

source: priority: %s
ru: приоритет: %s

source: update package v%s
ru: пакет обновлений v%s

source: Period of autochecking updates: %s
ru: Период автопроверки обновлений: %s

source: Package checksum
ru: Контрольная сумма пакета

source: Published: %s
ru: Опубликован: %s

source: Package description
ru: Описание пакета

source: Information about update package
ru: Информация о пакете обновлений

source: info and installation
ru: информация и установка

source: Install this package
ru: Установить этот пакет

source: you can cancel installation
ru: можете отменить установку

source: preparing this package to apply
ru: подготавливается к установке

source: Priority: %s
ru: Приоритет: %s

source: Size: %s
ru: Размер: %s

source: Advanced info
ru: Дополнительная информация

source: For the version: %s
ru: Для версии: %s

source: Update server address: %s
ru: Сервер обновлений: %s

source: (<span style="color: #600;">not active</span>)
ru: (<span style="color: #600;">выключен</span>)

source: (<span style="color: #060;">active</span>)
ru: (<span style="color: #060;">включён</span>)

source: Version of the system: %s
ru: Версия системы: %s

source: Type of update packages: %s
ru: Тип пакета обновлений: %s

source: Current status
ru: Текущее состояние

source: An update for framework is available
ru: Доступно обновление фреймворка

source: Version of Zend Framework: %s (%s)
ru: Версия Zend Framework: %s (%s)

source: Canceled to prepare update package &laquo;%s&raquo;
ru: Отменил подготовку пакета обновлений &laquo;%s&raquo;

source: Check of new updates
ru: Проверка новых обновлений

source: Started to prepare update package &laquo;%s&raquo;
ru: Начал подготовку пакета обновлений &laquo;%s&raquo;

source: Update package &laquo;%s&raquo; was successfully installed
ru: Пакет обновлений &laquo;%s&raquo; успешно установлен

source: Record with this ID already exists
ru: Запись с таким ID уже существует

source: System didn't manage to extract files from update package "%s". Perhaps archieve is damaged
ru: Системе не удалось извлечь файлы из пакета обновлений "%s". Возможно архив поврежден

source: New updates are available for the system. Please, acquaint with description of each package on the main page of update module
ru: Для системы доступны новые обновления. Пожалуйста, ознакомьтесь с описанием каждого на главной странице модуля обновлений

source: There are no new update packages for the system
ru: Новых пакетов для обновления системы нет

source: System didn't find a package with such number
ru: Системе не удалось найти пакет обновлений под таким номером

source: System didn't manage to download update package from the server. Response: &laquo;%s&raquo;
ru: Системе не удалось загрузить пакет обновлений с сервера. Сообщение: &laquo;%s&raquo;

source: Update package "%s" is not available for reading<br />Check file permissions
ru: Пакет обновлений "%s" недоступен для чтения<br />Проверьте права на файл

source: System is preparing update package. Installation will be done in the period determined by admin.<br />To cancel installation use link on the main page of update module for this package
ru: Пакет обновлений подготавливается системой. Установка будет произведена в период, установленный администратором.<br />Чтобы отменить установку, воспользуйтесь ссылкой на главной странице обновлений у соответствующего пакета

source: System didn't manage to open update package "%s". Perhaps archive is damaged
ru: Системе не удалось открыть пакет обновлений "%s". Возможно архив поврежден

source: Checksum of update package "%s" don't correspond to the original one<br />Launch checking updates once more
ru: Контрольная сумма пакета обновлений "%s" не соответствует оригинальной<br />Запустите процесс проверки обновлений заново

source: While updating database an error "%s" has occured. System updating was not fully completed
ru: При обновлении Базы Данных возникла ошибка "%s". Обновление системы полностью не выполнено

source: Subscription term for updates has expired. Please <a href="http://cms.2ka.by/subscribe/" target="_blank">follow this link</a> to prolong the service. Or deactivate updates in the settings.
ru: Срок подписки на обновления истек. Пожалуйста, <a href="http://cms.2ka.by/subscribe/" target="_blank">перейдите по данной ссылке</a>, чтобы продлить услугу. Либо отключите обновления в разделе настроек.

source: Version of update system became obsolete and doesn't correspond with update server.<br />Please, modernize the system manually. You can get additional information in the coincident documentation section
ru: Версия системы обновлений данного продукта устарела и не соответствует версии сервера обновлений.<br />Пожалуйста, обновите систему вручную. За дополнительной информацией обратитесь в соотв. раздел документации

source: This update package should be installed on the version %s, current version is %s<br />Update the system to the required version by appropriate packages and repeat this step, or remove it if the package became obsolete
ru: Данный пакет обновлений ставится на версию %s, текущая версия %s<br />Обновите систему до необходимой версии соотв. пакетами и повторите данный шаг либо, если пакет устарел, удалите его.

source: Connection to the update server was lost, or update server was appointed incorrectly
ru: Связь с сервером обновлений утеряна, либо сервер обновлений указан неправильно

source: Update package was successfully installed on the system
ru: Пакет обновлений успешно установлен в систему

source: The system could not find an archive with the update
ru: Система не смогла найти архив с обновлением

source: The system was unable to save data to the disc
ru: Система не смогла сохранить данные на носитель

source: Update has already been downloaded and is awaiting installation
ru: Обновление уже загружено и ожидает установки

source: Zend Framework doesn't need to be updated
ru: Zend Framework не нужнается в обновлении

source: In order to check existence, <a href='/open/admin-update/?action=checknow'>click this link</a>
ru: Чтобы проверить наличие, <a href='/open/admin-update/?action=checknow'>кликните по этой сылке</a>

source: current status of system and update settings
ru: текущее состояние системы и настройки обновления

source: downloading and installation of packages from update server
ru: загрузка пакетов с сервера обновлений и их установка

source: available update packages for the system
ru: доступные пакеты обновлений для системы

source: brief information about this update package
ru: краткая информация о данном пакете обновлений

source: detailed description about this package and installation
ru: детальное описание пакета и установка

source: technical description of the package
ru: техническое описание пакета

source: File with records for the &laquo;Update module&raquo;
ru: Файл с записями для модуля &laquo;обновлений системы&raquo;

source: the section will help to update the main component of the system
ru: раздел поможет обновить основной компонент системы

source: shows the process of updating
ru: отображает процесс обновления

source: Archive loaded and waiting for installation
ru: Архив загружен и ожидает установки

source: Downloading&hellip;
ru: Загружаем&hellip;

source: Initialization&hellip;
ru: Инициализация&hellip;

source: the list of packages that were installed in the system
ru: список пакетов, которые были установлены в систему
